In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
df = pd.read_csv('TugasDataSainsW3.csv',delimiter=';')
pd.set_option('display.float_format', '{:.2f}'.format)
print(df.describe())

df.head()

            Price  Discount  Quantity
count      200.00    180.00    200.00
mean   9936427.87     10.47      3.04
std    5453360.31      6.80      1.40
min     513621.00      0.00      1.00
25%    5130300.25      5.00      2.00
50%    9185244.00     10.00      3.00
75%   14604530.75     15.00      4.00
max   19763599.00     20.00      5.00

,Customer_Name,Product,Price,Discount,Quantity,Total_Price,Transaction_Date,Birth_Date,Location,Payment_Method
0,CHARLES EDWARDS,Tablet,8717207,5.00,2,16.562.693.299.999.900,01/12/2025,18/06/2001,Jakarta,Cash on Delivery
1,tiffany williams,Smartwatch,1566449,0.00,1,1566449.0,31/12/2024,18/07/2002,Surabaya,Cash on Delivery
2,Edward Shepherd,Camera,18785201,15.00,2,31934841.7,23/11/2024,12/11/2001,NaN,PayPal
3,WAYNE SIMS,Smartphone,14680586,10.00,3,39637582.2,02/10/2024,29/01/2003,Surabaya,PayPal
4,julie wolf,Smartwatch,3745263,10.00,3,10112210.1,04-19-2024,NaN,Bandung,Credit Card

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_Name     200 non-null    object
 1   Product           200 non-null    object
 2   Price             200 non-null    float64
 3   Discount          180 non-null    float64
 4   Quantity          200 non-null    int64
 5   Total_Price       196 non-null    object
 6   Transaction_Date  200 non-null    object
 7   Birth_Date        180 non-null    object
 8   Location          180 non-null    object
 9   Payment_Method    180 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 15.8+ KB

In [ ]:
# df['Price'] = df['Price'].astype(float)
# df['Discount'] = df['Discount'].astype(int)
# df['Total_Price'] = df['Total_Price'].astype(float)
# df['Transaction_Date'] = pd.to_datetime(df['Transaction_Date'])
# df['Birth_Date'] = pd.to_datetime(df['Birth_Date'])
# df['Product'] = df['Product'].astype('category')
# df['Location'] = df['Location'].astype('category')
# df['Payment_Method'] = df['Payment_Method'].astype('category')

In [12]:
print('Data Duplicated : ', df.duplicated().sum())

Data Duplicated :  0